### ✅ Terraform Plan Generated
**Plan stored in S3 as pr-37.tfplan**
<details><summary>Show Plan</summary>
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository_policy.lambda_pull will be updated in-place
  ~ resource "aws_ecr_repository_policy" "lambda_pull" {
        id          = "blockchain-api"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Sid       = "LambdaPullPermission" -> "LambdaPull"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "blockchain-verification-api"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "CONTRACT_ADDRESS"     = "placeholder" -> "0x0000000000000000000000000000000000000000"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_public_url must be replaced
-/+ resource "aws_lambda_permission" "allow_public_url" {
      ~ id                     = "AllowPublicFunctionUrlInvoke" -> (known after apply)
      ~ statement_id           = "AllowPublicFunctionUrlInvoke" -> "AllowPublicInvoke" # forces replacement
      + statement_id_prefix    = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_s3_bucket.artifact_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "artifact_bucket" {
        id                          = "blockchain-artifacts-20251210113937528100000001"
      ~ tags                        = {
          - "Environment" = "Production" -> null
            "Project"     = "BlockCICD"
          + "Type"        = "Artifacts"
        }
      ~ tags_all                    = {
          - "Environment" = "Production" -> null
          + "Type"        = "Artifacts"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.website_bucket will be created
  + resource "aws_s3_bucket" "website_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "auditor-dashboard-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Project" = "BlockCICD"
          + "Type"    = "Dashboard"
        }
      + tags_all                    = {
          + "Project" = "BlockCICD"
          + "Type"    = "Dashboard"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.public_read will be created
  + resource "aws_s3_bucket_policy" "public_read" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.block_private will be created
  + resource "aws_s3_bucket_public_access_block" "block_private" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "blockchain-artifacts-20251210113937528100000001"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.block_public will be destroyed
  # (because aws_s3_bucket_public_access_block.block_public is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "block_public" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "blockchain-artifacts-20251210113937528100000001" -> null
      - id                      = "blockchain-artifacts-20251210113937528100000001" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.block_public_read will be created
  + resource "aws_s3_bucket_public_access_block" "block_public_read" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_website_configuration.website_config will be created
  + resource "aws_s3_bucket_website_configuration" "website_config" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 6 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  + dashboard_url        = (known after apply)
  + website_bucket_name  = (known after apply)

```
</details>